SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_prs.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 PRS register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_PRS_H
#define EFR32SG28_PRS_H

#define PRS_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_PRS PRS
 * @{
 * @brief EFR32SG28 PRS Register Declaration.
 *****************************************************************************/

/** PRS ASYNC_CH Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             CTRL;                   /**< Async Channel Control Register                     */
} PRS_ASYNC_CH_TypeDef;


/** PRS SYNC_CH Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             CTRL;                   /**< Sync Channel Control Register                      */
} PRS_SYNC_CH_TypeDef;


/** PRS Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< PRS IPVERSION                                      */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             ASYNC_SWPULSE;          /**< Software Pulse Register                            */
  __IOM uint32_t             ASYNC_SWLEVEL;          /**< Software Level Register                            */
  __IM  uint32_t             ASYNC_PEEK;             /**< Async Channel Values                               */
  __IM  uint32_t             SYNC_PEEK;              /**< Sync Channel Values                                */
        PRS_ASYNC_CH_TypeDef ASYNC_CH[12U];     /**< Async Channel registers                            */
        PRS_SYNC_CH_TypeDef  SYNC_CH[4U];       /**< Sync Channel registers                             */
  __IOM uint32_t             CONSUMER_CMU_CALDN;     /**< CALDN consumer register                            */
  __IOM uint32_t             CONSUMER_CMU_CALUP;     /**< CALUP Consumer register                            */
  __IOM uint32_t             CONSUMER_EUSART0_CLK;   /**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART0_RX;    /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART0_TRIGGER;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART1_CLK;   /**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART1_RX;    /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART1_TRIGGER;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART2_CLK;   /**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART2_RX;    /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART2_TRIGGER;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_IADC0_SCANTRIGGER;/**< SCAN consumer register                             */
  __IOM uint32_t             CONSUMER_IADC0_SINGLETRIGGER;/**< SINGLE Consumer register                           */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ0;/**< DMAREQ0 consumer register                          */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ1;/**< DMAREQ1 Consumer register                          */
        uint32_t             RESERVED2[4U];          /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_LESENSE_START; /**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_CLEAR;/**< CLEAR consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_START;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_STOP; /**< STOP Consumer register                             */
  __IOM uint32_t             CONSUMER_MODEM_DIN;     /**< MODEM DIN consumer register                        */
  __IOM uint32_t             CONSUMER_PCNT0_S0IN;    /**< S0IN consumer register                             */
  __IOM uint32_t             CONSUMER_PCNT0_S1IN;    /**< S1IN Consumer register                             */
        uint32_t             RESERVED3[11U];         /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_RAC_CLR;       /**< CLR consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN0;    /**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN1;    /**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN2;    /**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN3;    /**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_FORCETX;   /**< FORCETX Consumer register                          */
  __IOM uint32_t             CONSUMER_RAC_RXDIS;     /**< RXDIS Consumer register                            */
  __IOM uint32_t             CONSUMER_RAC_RXEN;      /**< RXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_RAC_TXEN;      /**< TXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC25;/**< TAMPERSRC25 consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC26;/**< TAMPERSRC26 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC27;/**< TAMPERSRC27 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC28;/**< TAMPERSRC28 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC29;/**< TAMPERSRC29 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC30;/**< TAMPERSRC30 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC31;/**< TAMPERSRC31 Consumer register                      */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN0;   /**< IN0 consumer register                              */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN1;   /**< IN1 Consumer register                              */
  __IOM uint32_t             CONSUMER_HFXO0_OSCREQ;  /**< OSCREQ consumer register                           */
  __IOM uint32_t             CONSUMER_HFXO0_TIMEOUT; /**< TIMEOUT Consumer register                          */
  __IOM uint32_t             CONSUMER_CORE_CTIIN0;   /**< CTI0 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN1;   /**< CTI1 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN2;   /**< CTI2 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN3;   /**< CTI3 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_M33RXEV;  /**< M33 Consumer Selection                             */
  __IOM uint32_t             CONSUMER_TIMER0_CC0;    /**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC1;    /**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC2;    /**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTI;    /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS1; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS2; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC0;    /**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC1;    /**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC2;    /**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTI;    /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS1; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS2; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC0;    /**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC1;    /**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC2;    /**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTI;    /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS1; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS2; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC0;    /**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC1;    /**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC2;    /**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTI;    /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS1; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS2; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC0;    /**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC1;    /**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC2;    /**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTI;    /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS1; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS2; /**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_CLK;    /**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_USART0_IR;     /**< IR Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_RX;     /**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_USART0_TRIGGER;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED4[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH0;/**< ASYNCTRIG consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_ASYNCTRIGCH1;/**< ASYNCTRIG Consumer register                        */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH0;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_VDAC0_SYNCTRIGCH1;/**< SYNCTRIG Consumer register                         */
  __IOM uint32_t             CONSUMER_WDOG0_SRC0;    /**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG0_SRC1;    /**< SRC1 Consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC0;    /**< SRC0 consumer register                             */
  __IOM uint32_t             CONSUMER_WDOG1_SRC1;    /**< SRC1 Consumer register                             */
        uint32_t             RESERVED5[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED6[893U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< PRS IPVERSION                                      */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             ASYNC_SWPULSE_SET;      /**< Software Pulse Register                            */
  __IOM uint32_t             ASYNC_SWLEVEL_SET;      /**< Software Level Register                            */
  __IM  uint32_t             ASYNC_PEEK_SET;         /**< Async Channel Values                               */
  __IM  uint32_t             SYNC_PEEK_SET;          /**< Sync Channel Values                                */
        PRS_ASYNC_CH_TypeDef ASYNC_CH_SET[12U]; /**< Async Channel registers                            */
        PRS_SYNC_CH_TypeDef  SYNC_CH_SET[4U];   /**< Sync Channel registers                             */
  __IOM uint32_t             CONSUMER_CMU_CALDN_SET; /**< CALDN consumer register                            */
  __IOM uint32_t             CONSUMER_CMU_CALUP_SET; /**< CALUP Consumer register                            */
  __IOM uint32_t             CONSUMER_EUSART0_CLK_SET;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART0_RX_SET;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART0_TRIGGER_SET;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART1_CLK_SET;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART1_RX_SET;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART1_TRIGGER_SET;/**< TRIGGER Consumer register                          */
  __IOM uint32_t             CONSUMER_EUSART2_CLK_SET;/**< CLK consumer register                              */
  __IOM uint32_t             CONSUMER_EUSART2_RX_SET;/**< RX Consumer register                               */
  __IOM uint32_t             CONSUMER_EUSART2_TRIGGER_SET;/**< TRIGGER Consumer register                          */
        uint32_t             RESERVED8[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_IADC0_SCANTRIGGER_SET;/**< SCAN consumer register                             */
  __IOM uint32_t             CONSUMER_IADC0_SINGLETRIGGER_SET;/**< SINGLE Consumer register                           */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ0_SET;/**< DMAREQ0 consumer register                          */
  __IOM uint32_t             CONSUMER_LDMAXBAR_DMAREQ1_SET;/**< DMAREQ1 Consumer register                          */
        uint32_t             RESERVED9[4U];          /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_LESENSE_START_SET;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_CLEAR_SET;/**< CLEAR consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_START_SET;/**< START Consumer register                            */
  __IOM uint32_t             CONSUMER_LETIMER0_STOP_SET;/**< STOP Consumer register                             */
  __IOM uint32_t             CONSUMER_MODEM_DIN_SET; /**< MODEM DIN consumer register                        */
  __IOM uint32_t             CONSUMER_PCNT0_S0IN_SET;/**< S0IN consumer register                             */
  __IOM uint32_t             CONSUMER_PCNT0_S1IN_SET;/**< S1IN Consumer register                             */
        uint32_t             RESERVED10[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             CONSUMER_RAC_CLR_SET;   /**< CLR consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN0_SET;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN1_SET;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN2_SET;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_CTIIN3_SET;/**< CTI Consumer register                              */
  __IOM uint32_t             CONSUMER_RAC_FORCETX_SET;/**< FORCETX Consumer register                          */
  __IOM uint32_t             CONSUMER_RAC_RXDIS_SET; /**< RXDIS Consumer register                            */
  __IOM uint32_t             CONSUMER_RAC_RXEN_SET;  /**< RXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_RAC_TXEN_SET;  /**< TXEN Consumer register                             */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC25_SET;/**< TAMPERSRC25 consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC26_SET;/**< TAMPERSRC26 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC27_SET;/**< TAMPERSRC27 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC28_SET;/**< TAMPERSRC28 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC29_SET;/**< TAMPERSRC29 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC30_SET;/**< TAMPERSRC30 Consumer register                      */
  __IOM uint32_t             CONSUMER_SETAMPER_TAMPERSRC31_SET;/**< TAMPERSRC31 Consumer register                      */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN0_SET;/**< IN0 consumer register                              */
  __IOM uint32_t             CONSUMER_SYSRTC0_IN1_SET;/**< IN1 Consumer register                              */
  __IOM uint32_t             CONSUMER_HFXO0_OSCREQ_SET;/**< OSCREQ consumer register                           */
  __IOM uint32_t             CONSUMER_HFXO0_TIMEOUT_SET;/**< TIMEOUT Consumer register                          */
  __IOM uint32_t             CONSUMER_CORE_CTIIN0_SET;/**< CTI0 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN1_SET;/**< CTI1 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN2_SET;/**< CTI2 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_CTIIN3_SET;/**< CTI3 Consumer Selection                            */
  __IOM uint32_t             CONSUMER_CORE_M33RXEV_SET;/**< M33 Consumer Selection                             */
  __IOM uint32_t             CONSUMER_TIMER0_CC0_SET;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC1_SET;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_CC2_SET;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTI_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS1_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER0_DTIFS2_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC0_SET;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC1_SET;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_CC2_SET;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTI_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS1_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER1_DTIFS2_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC0_SET;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC1_SET;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_CC2_SET;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTI_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS1_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER2_DTIFS2_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC0_SET;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC1_SET;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_CC2_SET;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTI_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS1_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER3_DTIFS2_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC0_SET;/**< CC0 consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC1_SET;/**< CC1 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_CC2_SET;/**< CC2 Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTI_SET;/**< DTI Consumer register                              */
  __IOM uint32_t             CONSUMER_TIMER4_DTIFS1_SET;/**< DTI Consumer register                              */
